#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
azuread_application.ACR-application: Refreshing state... [id=5c0362d3-2156-4a73-9ce3-d385db6347a7]
azuread_application_password.ACR-application-password: Refreshing state... [id=5c0362d3-2156-4a73-9ce3-d385db6347a7/password/8d32db84-e838-4415-b6d0-b2f034325395]
data.azuread_client_config.current: Reading...
data.azuread_client_config.current: Read complete after 0s [id=e2584cbb-77a2-443d-b6c7-e3436ddf47eb-00685ac7-79c2-49be-91b5-9996f272ffab-4f2ea9b9-9fb0-4dd3-9011-de40855fb0f3]
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=2022-07-20 12:31:50.215116352 +0000 UTC]
azurerm_resource_group.rg-projectf-dev-001: Refreshing state... [id=/subscriptions/039c5e5c-dcac-426f-9174-a04e1c39f8a3/resourceGroups/rg-projectf-dev-001]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # azuread_application.ACR-access-app will be created
  + resource "azuread_application" "ACR-access-app" {
      + app_role_ids                = (known after apply)
      + application_id              = (known after apply)
      + disabled_by_microsoft       = (known after apply)
      + display_name                = "TerraformAcrAccess"
      + id                          = (known after apply)
      + logo_url                    = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + object_id                   = (known after apply)
      + prevent_duplicate_names     = false
      + publisher_domain            = (known after apply)
      + sign_in_audience            = "AzureADMyOrg"
    }

  # azuread_application.ACR-application will be destroyed
  # (because azuread_application.ACR-application is not in configuration)
  - resource "azuread_application" "ACR-application" {
      - app_role_ids                   = {} -> null
      - application_id                 = "2d4b89e5-31c5-42f1-b6e5-cdf48c64c2ca" -> null
      - device_only_auth_enabled       = false -> null
      - disabled_by_microsoft          = "<nil>" -> null
      - display_name                   = "GithubActionsAcrAccess" -> null
      - fallback_public_client_enabled = false -> null
      - group_membership_claims        = [] -> null
      - id                             = "5c0362d3-2156-4a73-9ce3-d385db6347a7" -> null
      - identifier_uris                = [] -> null
      - oauth2_permission_scope_ids    = {} -> null
      - oauth2_post_response_required  = false -> null
      - object_id                      = "5c0362d3-2156-4a73-9ce3-d385db6347a7" -> null
      - owners                         = [
          - "4f2ea9b9-9fb0-4dd3-9011-de40855fb0f3",
        ] -> null
      - prevent_duplicate_names        = false -> null
      - publisher_domain               = "dziedzic.me" -> null
      - sign_in_audience               = "AzureADMyOrg" -> null

      - api {
          - known_client_applications      = [] -> null
          - mapped_claims_enabled          = false -> null
          - requested_access_token_version = 1 -> null
        }

      - optional_claims {
        }

      - public_client {
          - redirect_uris = [] -> null
        }

      - single_page_application {
          - redirect_uris = [] -> null
        }

      - web {
          - redirect_uris = [] -> null

          - implicit_grant {
              - access_token_issuance_enabled = false -> null
              - id_token_issuance_enabled     = false -> null
            }
        }
    }

  # azuread_application_password.ACR-access-app-password will be created
  + resource "azuread_application_password" "ACR-access-app-password" {
      + application_object_id = (known after apply)
      + display_name          = "GithubActionsAcrAccessSecret"
      + end_date              = "2022-09-01T01:02:03Z"
      + id                    = (known after apply)
      + key_id                = (known after apply)
      + start_date            = (known after apply)
      + value                 = (sensitive value)
    }

  # azuread_application_password.ACR-application-password will be destroyed
  # (because azuread_application_password.ACR-application-password is not in configuration)
  - resource "azuread_application_password" "ACR-application-password" {
      - application_object_id = "5c0362d3-2156-4a73-9ce3-d385db6347a7" -> null
      - end_date              = "2299-12-31T00:00:00Z" -> null
      - id                    = "5c0362d3-2156-4a73-9ce3-d385db6347a7/password/8d32db84-e838-4415-b6d0-b2f034325395" -> null
      - key_id                = "8d32db84-e838-4415-b6d0-b2f034325395" -> null
      - start_date            = "2022-07-20T09:30:54Z" -> null
      - value                 = (sensitive value)
    }

  # azurerm_key_vault.akv-terraform-secrets will be created
  + resource "azurerm_key_vault" "akv-terraform-secrets" {
      + access_policy               = [
          + {
              + application_id          = null
              + certificate_permissions = null
              + key_permissions         = null
              + object_id               = "4f2ea9b9-9fb0-4dd3-9011-de40855fb0f3"
              + secret_permissions      = [
                  + "Get",
                  + "Set",
                ]
              + storage_permissions     = null
              + tenant_id               = "e2584cbb-77a2-443d-b6c7-e3436ddf47eb"
            },
        ]
      + enabled_for_disk_encryption = true
      + id                          = (known after apply)
      + location                    = "northeurope"
      + name                        = "akv-projectf-dev-001"
      + purge_protection_enabled    = false
      + resource_group_name         = "rg-projectf-terraform-dev-001"
      + sku_name                    = "standard"
      + soft_delete_retention_days  = 7
      + tags                        = {
          + "CreatedBy" = "4f2ea9b9-9fb0-4dd3-9011-de40855fb0f3"
        }
      + tenant_id                   = "e2584cbb-77a2-443d-b6c7-e3436ddf47eb"
      + vault_uri                   = (known after apply)

      + network_acls {
          + bypass                     = (known after apply)
          + default_action             = (known after apply)
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = (known after apply)
        }
    }

Plan: 3 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  - application-passoword-output       = (sensitive value)
  + service-principal-passoword-output = (sensitive value)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pushed by: @Retoxx-dev, Action: `pull_request`*